public class Answer4Question {
    public static void main(String[] args) {
        System.out.println("Ответ - хэшсэт. В случае с хэшсетом containAll будет идти не через циклы и полностью проверять " +
                "все элементы, а будет исп-ся ускорение поиска за счет хэшкода. Хэшсэт разбивает всю коллекцию" +
                "по хэшкодам, и объекты у кот. одинаковый хэшкод, будут храниться в одном бакете. Далее берется " +
                "хэшкод элемента коллекции и проверяется через иквлз есть ли он такм или нет.");
    }

}
